tap "badxkarma/badxkarma"
tap "crowdstrike/foundry-cli"
tap "fsouza/prettierd"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "snyk/tap"
brew "asciinema"
brew "aws-sso-cli"
brew "awscli"
brew "bat"
brew "bat-extras"
brew "cmake"
brew "cmake-docs"
brew "cmatrix"
brew "cookiecutter"
brew "diff-so-fancy"
brew "eslint"
brew "fd"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "glow"
brew "gnupg"
brew "grepcidr"
brew "htop"
brew "inetutils"
brew "iperf"
brew "jq"
brew "lolcat"
brew "lsd"
brew "luarocks"
brew "mdcat"
brew "mtr"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node@16"
brew "node@18"
brew "pinentry-mac"
brew "pipx"
brew "poetry"
brew "prettier"
brew "pyenv"
brew "ripgrep"
brew "rust"
brew "sevenzip"
brew "speedtest-cli"
brew "stylua"
brew "terminal-notifier"
brew "tfenv"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "vault"
brew "vim"
brew "virtualenv"
brew "virtualenvwrapper"
brew "virustotal-cli"
brew "wget"
brew "yq"
brew "z"
brew "zsh"
brew "badxkarma/badxkarma/pokemonsay"
brew "crowdstrike/foundry-cli/foundry"
brew "fsouza/prettierd/prettierd"
brew "snyk/tap/snyk"
cask "1password-cli"
cask "audacity"
cask "aws-vault"
cask "burp-suite"
cask "copyq"
cask "font-hack-nerd-font"
cask "font-monaspace-nerd-font"
cask "gpg-suite-no-mail"
cask "keka"
cask "obsidian"
cask "postman"
cask "powershell"
cask "pycharm-ce"
cask "sublime-text"
cask "todoist"
cask "wireshark"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "linhmtran168.mac-ca-vscode"
vscode "luggage66.awk"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "wolfieshorizon.python-auto-venv"
