tap "badxkarma/badxkarma"
tap "cjbassi/ytop"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "ack"
brew "openssl@1.1"
brew "readline"
brew "sqlite"
brew "xz"
brew "asciinema"
brew "awscli"
brew "bat"
brew "cmatrix"
brew "coreutils"
brew "diff-so-fancy"
brew "docker-machine"
brew "fd"
brew "fish"
brew "fortune"
brew "fzf"
brew "giflossy"
brew "git"
brew "glow"
brew "gnupg"
brew "grepcidr"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lolcat"
brew "lsd"
brew "neofetch"
brew "nmap"
brew "node"
brew "pfetch"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby"
brew "smartmontools"
brew "speedtest-cli"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
brew "vim"
brew "wget"
brew "zlib"
brew "zsh"
brew "badxkarma/badxkarma/pokemonsay"
brew "cjbassi/ytop/ytop"
cask "copyq"
cask "discord"
cask "firefox"
cask "font-hack-nerd-font"
cask "gpg-suite-no-mail"
cask "iterm2"
cask "keka"
cask "postman"
cask "stay"
cask "sublime-text"
cask "visual-studio-code"
cask "wireshark"
